# IMPORTS

In [1]:
# data manipulation
import pandas as pd
import numpy  as np

# data visutalization
import matplotlib.pyplot as plt
import seaborn           as sns

# stats
import scipy as ss

# HELPER FUNCTIONS

In [2]:
def jupyter_settings():
    %matplotlib inline
    %pylab inline
    
    plt.style.use( 'fivethirtyeight' )
    plt.rcParams['figure.figsize'] = [20, 8]
    plt.rcParams['font.size'] = 24
    plt.rcParams['font.family'] = 'serif'
    plt.rcParams['font.serif'] = 'Ubuntu'
    plt.rcParams['font.monospace'] = 'Ubuntu Mono'
    plt.rcParams['font.size'] = 12
    plt.rcParams['axes.labelsize'] = 14
    plt.rcParams['axes.labelweight'] = 'bold'
    plt.rcParams['axes.titlesize'] = 15
    plt.rcParams['xtick.labelsize'] = 10
    plt.rcParams['ytick.labelsize'] = 10
    plt.rcParams['legend.fontsize'] = 12
    plt.rcParams['figure.titlesize'] = 12
    
    display( HTML( '<style>.container { width:80% !important; }</style>') )
    pd.options.display.max_columns = None
    pd.options.display.max_rows = None
    pd.set_option( 'display.expand_frame_repr', False )
    
    #sns.set()
    sns.set_style('ticks')

In [3]:
def get_summary(numerical_attributes):
    
    # Central Tendency - mean, median 
    ct1 = pd.DataFrame( numerical_attributes.apply( np.mean ) ).T
    ct2 = pd.DataFrame( numerical_attributes.apply( np.median ) ).T

    # dispersion - std, min, max, range, skew, kurtosis
    d1 = pd.DataFrame( numerical_attributes.apply( np.std ) ).T 
    d2 = pd.DataFrame( numerical_attributes.apply( min ) ).T 
    d3 = pd.DataFrame( numerical_attributes.apply( max ) ).T 
    d4 = pd.DataFrame( numerical_attributes.apply( lambda x: x.max() - x.min() ) ).T 
    d5 = pd.DataFrame( numerical_attributes.apply( lambda x: x.skew() ) ).T 
    d6 = pd.DataFrame( numerical_attributes.apply( lambda x: x.kurtosis() ) ).T 

    # concatenar
    m = pd.concat( [d2, d3, d4, ct1, ct2, d1, d5, d6] ).T.reset_index()
    m.columns = ['attributes', 'min', 'max', 'range', 'mean', 'median', 'std', 'skew', 'kurtosis']
    
    return m

# DATA LOADING

In [31]:
cat_school_data = pd.read_csv('/Users/brunoschirmer/Repos/murabei/data/cat_school_data.csv', sep=';')
cat_student_data = pd.read_csv('/Users/brunoschirmer/Repos/murabei/data/cat_student_data.csv', sep=';')
num_school_data = pd.read_csv('/Users/brunoschirmer/Repos/murabei/data/num_school_data.csv', sep=';')
num_student_data = pd.read_csv('/Users/brunoschirmer/Repos/murabei/data/num_student_data.csv', sep=';')

In [27]:
cat_student_data = pd.read_csv('/Users/brunoschirmer/Repos/murabei/data/cat_student_data.csv')

In [32]:
cat_student_data.head()

   school  student variable       value
1       1      143   intake  bottom 25%
2       1      145   intake     mid 50%
3       1      142   intake     top 25%
4       1      141   intake     mid 50%
5       1      138   intake     mid 50%

In [42]:
df_raw = pd.pivot_table(data = cat_student_data, index='school', columns='variable', values='value').reset_index()
df_raw.head()

/usr/local/lib/python3.9/site-packages/pandas/core/apply.py:507: FutureWarning: Dropping invalid columns in DataFrameGroupBy.mean is deprecated. In a future version, a TypeError will be raised. Before calling .mean, select only columns which should be valid for the function.
  return self._try_aggregate_string_function(obj, f, *self.args, **self.kwargs)

variable  school
0              1
1              2
2              3
3              4
4              5

In [ ]:
df_raw = pd.pivot_table(data = cat_student_data, index='school', columns='variable', values='value').reset_index()
df_raw.head()

In [46]:
df_raw = pd.melt(cat_student_data, id_vars=['school', 'student'], var_name='variable', value_vars='value').reset_index()
df_raw.head()

/usr/local/lib/python3.9/site-packages/IPython/core/interactiveshell.py:3444: FutureWarning: This dataframe has a column name that matches the 'value_name' column name of the resulting Dataframe. In the future this will raise an error, please set the 'value_name' parameter of DataFrame.melt to a unique name.
  exec(code_obj, self.user_global_ns, self.user_ns)

   index  school  student variable       value
0      0       1      143    value  bottom 25%
1      1       1      145    value     mid 50%
2      2       1      142    value     top 25%
3      3       1      141    value     mid 50%
4      4       1      138    value     mid 50%

In [33]:
num_school_data.head()

   school variable      value
0       1   schavg  0,1661752
1       2   schavg  0,3951492
2       3   schavg  0,5141552
3       4   schavg  0,0917642
4       5   schavg  0,2105252

In [34]:
num_student_data.head()

   school  student  variable      value
1       1    143.0  normexam  0,2613242
2       1    145.0  normexam  0,1340672
3       1    142.0  normexam  -1,723882
4       1    141.0  normexam  0,9675862
5       1    138.0  normexam  0,5443412

# CAT SCHOOL

In [30]:
cat_school_data.head()

   school variable  value
0       1  schgend  mixed
1       2  schgend  girls
2       3  schgend  mixed
3       4  schgend  mixed
4       5  schgend  mixed

In [6]:
cat_school_data = cat_school_data['school;"variable";"value"'].str.split(';', expand = True)

In [7]:
cat_school_data.head()

   0          1        2
0  1  "schgend"  "mixed"
1  2  "schgend"  "girls"
2  3  "schgend"  "mixed"
3  4  "schgend"  "mixed"
4  5  "schgend"  "mixed"

In [14]:
cat_school_data.columns = ['school','variable','gender']
cat_school_data = cat_school_data.drop('variable', 1)

/var/folders/04/fz9wjmrx1fvgdw9ycmx8w0cr0000gn/T/ipykernel_37197/4254965563.py:2: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only
  cat_school_data = cat_school_data.drop('variable', 1)

In [15]:
cat_school_data.head()

  school   gender
0      1  "mixed"
1      2  "girls"
2      3  "mixed"
3      4  "mixed"
4      5  "mixed"

# CAT STUDENT

In [28]:
cat_student_data.head()

  school;"student";"variable";"value"
0   1;"1";"143";"intake";"bottom 25%"
1      2;"1";"145";"intake";"mid 50%"
2      3;"1";"142";"intake";"top 25%"
3      4;"1";"141";"intake";"mid 50%"
4      5;"1";"138";"intake";"mid 50%"

In [24]:
cat_student_data['school;"student";"variable";"value"'].str.split(';', expand = True)

           0     1      2         3             4
0          1   "1"  "143"  "intake"  "bottom 25%"
1          2   "1"  "145"  "intake"     "mid 50%"
2          3   "1"  "142"  "intake"     "top 25%"
3          4   "1"  "141"  "intake"     "mid 50%"
4          5   "1"  "138"  "intake"     "mid 50%"
...      ...   ...    ...       ...           ...
11823  12173  "65"   "46"      "vr"     "mid 50%"
11824  12174  "65"   "59"      "vr"     "mid 50%"
11825  12175  "65"   "60"      "vr"     "mid 50%"
11826  12176  "65"   "61"      "vr"     "mid 50%"
11827  12177  "65"   "56"      "vr"     "mid 50%"

[11828 rows x 5 columns]

In [25]:
cat_student_data.columns

Index(['school;"student";"variable";"value"'], dtype='object')

In [26]:
cat_school_data.columns = ['school','student','variable','value']

ValueError: Length mismatch: Expected axis has 2 elements, new values have 4 elements